
/***************************************************************************************************    
工程名称：	DA_LED
功能描述：	控制DA输出连续变化电压，使输出电压控制发光二极管D10由亮变暗。
硬件连接：  用2位杜邦线分别将J11_7与J17_SDA、J11_6与J17_SCL连接,用1位跳帽短接J19_LED与J19_AOUT。
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"      //包含头文件
#include"intrins.h"     //_nop_();延时函数用

sbit sda=P2^7;          //数据线
sbit scl=P2^6;          //时钟线

#define uchar unsigned char
#define uint  unsigned int

uchar temp[8]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};

uchar temp1[8];


//**************************************************************************************************
//延时
//**************************************************************************************************
delay(uint time)              //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;                  //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)         //for循环,循环50*time次
     for(j=0;j<50;j++);       //for循环,循环50次
 }
//**************************************************************************************************
//启动(SCL为高，SDA由高变为低是一个开始条件)
//**************************************************************************************************
void start()  
{	
	sda=1;    //数据线置高,
	_nop_();  //延时
	scl=1;    //时钟线置高
	_nop_();  //延时
	sda=0;    //数据线置低,由高变低
	_nop_();  //延时
	scl=0;    //时钟线置低,准备发送或接收数据,总线进入忙状态(I2C总线在空闲状态时，SDA与SCL均被置高)
	_nop_();  //延时
}
//**************************************************************************************************
//停止（SCL为高，SDA由低变为高是一个结束条件）
//**************************************************************************************************
void stop()   
{
	sda=0;                   //数据线置低
	_nop_();                 //延时
	scl=1;                   //时钟线置高
	_nop_();                 //延时
	sda=1;                   //数据线置高，由低变高
	_nop_();                 //延时
}
//**************************************************************************************************
//检测应答(所有的地址和数据字都是以8bit,在第9个时钟周期，从器件发出"0"信号来作为收到一个字的应答信号)
//**************************************************************************************************
void checkACK()                   //主器件检测从器件是否返回应答
{
	scl=1;                        //时钟线置高
	_nop_();                      //延时
	while(sda==1);                //等待第9个时钟周期器件发出的响应信号"0"
	scl=0;                        //时钟线置低
	_nop_();                      //延时
}
//**************************************************************************************************
//写一字节
//**************************************************************************************************
void send_byte(uchar date)       //写一个8位字
{
	uchar i,temp;                //定义局部变量
	temp=date;                   //待发8位数据赋予temp
	for(i=0;i<8;i++)             //循环8次，每次写入1位，从最高位开始发送
	{
        if(temp&0x80)sda=1;      //如果temp最高位为1则发送1
          else sda=0;            //如果temp最高位为0则发送0
	    _nop_();                 //延时
		scl=1;                   //给一个脉冲，发送sda当前这位数据
		_nop_();                 //延时,需大于4us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();                
		scl=0;                   //时钟线置低,准备下一脉冲
	    _nop_();                 //延时,需大于4.7us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();  
		temp=temp<<1;            //左移1位，准备好下1位待发送的数据
	}
	checkACK();                  //查询是否返回应答信号
}
//**************************************************************************************************
//DA转化函数
//**************************************************************************************************
DAC(uchar temp)
 {
   start();                 //启动总线
   send_byte(0x90);         //选择从器件地址,RW位为0，即选择写命令
   send_byte(0x40);         //寄存器设置
   send_byte(temp);         //写入数字量
   stop();                  //停止 
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()
{	
   uchar dat;                    //DA转换的数字量
   while(1)                      //死循环
    {
      for(dat=0;dat<1000;dat++)   //LED由亮变暗
       {
        DAC(dat);                //控制DA输出 
        delay(1000);              //延时
       }
   
	}
}