/***************************************************************************************************    
¹¤³ÌÃû³Æ£º	stepmotor
¹¦ÄÜÃèÊö£º  S17-Õı×ª¡¢S18-×ªËÙÖµ¼õ1¡¢S19-Æô¶¯/ÔİÍ£¡¢S20-×ªËÙÖµ¼Ó1¡¢S21-·´×ª£¬ÊıÂë¹ÜÏÔÊ¾ËÙ¶ÈµÈ¼¶
Ó²¼şÁ¬½Ó£º  ÓÃ8Î»¶Å°îÏß½«J8ÓëJ12Á¬½Ó£¬ÓÃ2Î»¶Å°îÏß·Ö±ğ½«J11_6ÓëJ15_DS1¼°J11_7ÓëJ15_DS2Á¬½Ó£¬
            ÓÃ4Î»¶Å°îÏßÁ¬½ÓJ11_0£¬J11_1£¬J11_2£¬J11_3ºÍJ18_A,J18_B,J18_C,J18_D,½«²½½øµç»úÁ¬½Óµ½JP8
            ÓÃ5Î»¶Å°îÏß½«J9_7ÓëJ7_s17¡¢J9_6ÓëJ7_s18¡¢J9_5ÓëJ7_s19¡¢J9_4ÓëJ7_s20¡¢J9_3ÓëJ7_s21¡£
Î¬»¤¼ÇÂ¼£º  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //°üº¬Í·ÎÄ¼ş

sbit S_A=P2^0;           //¶¨Òå²½½øµç»úAÏà
sbit S_B=P2^1;           //¶¨Òå²½½øµç»úBÏà
sbit S_C=P2^2;           //¶¨Òå²½½øµç»úCÏà
sbit S_D=P2^3;           //¶¨Òå²½½øµç»úDÏà

sbit S17=P3^7;           //Õı´«
sbit S18=P3^6;           //¶¨ÒåS18¿ØÖÆIO£¬µç»ú×ªËÙ¼õĞ¡
sbit S19=P3^5;           //Æô¶¯/ÔİÍ£
sbit S20=P3^4;           //¶¨ÒåS20¿ØÖÆIO£¬µç»ú×ªËÙ¼Ó´ó
sbit S21=P3^3;           //·´×ª

sbit LE1=P2^6;           //Î»Ñ¡573Ëø´æÆ÷Ê¹ÄÜ
sbit LE2=P2^7;           //¶ÎÑ¡573Ëø´æÆ÷Ê¹ÄÜ

bit zf,stop;

#define uchar unsigned char
#define uint  unsigned int
 
uint  speed;             //µç»ú×ªËÙ

uchar keyValue;          //¶¨Òå¼üÅÌÉ¨Ãè½á¹û²ÎÊı
uchar code dis[16]={0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,
                   //  0    1    2    3    4    5    6    7    
                     0x7F,0x6F,0x77,0x7C,0x39,0x5E,0x79,0x71};//0~FµÄ¶ÎÂë
                   //  8    9    A    B    C    D    E    F  

//**************************************************************************************************
//ÑÓÊ±º¯Êı
//**************************************************************************************************
delay(uint time)         //intĞÍÊı¾İÎª16Î»,ËùÒÔ×î´óÖµÎª65535            
 {
  uint  i,j;             //¶¨Òå±äÁ¿i,j,ÓÃÓÚÑ­»·Óï¾ä 
  for(i=0;i<time;i++)    //forÑ­»·,Ñ­»·50*time´Î
     for(j=0;j<50;j++);  //forÑ­»·,Ñ­»·50´Î
 }

//**************************************************************************************************
//ÊıÂë¹ÜÏÔÊ¾º¯Êı
//**************************************************************************************************
smg_show(uchar n)
{ 
      //ÏÔÊ¾¸öÎ»
     P1=0xbf;                 //0xbf=1011 1111,¼´Ñ¡Í¨¸öÎ»
     LE1=1;                   //Ëø´æÎ»
     LE1=0;                   //¶Ï¿ªËø´æ,Î»Ñ¡573µÄQ7~Q0ÈÔ±£³Ö 
     P1=dis[n/10];            //dis[n/10]Îª0~9µÄ±àÂë
     LE2=1;                   //Ëø´æ¶ÎÂë
     LE2=0;                   //¶Ï¿ªËø´æ,¶ÎÑ¡573µÄQ7~Q0ÈÔ±£³Ö
     delay(10);              //ÑÓÊ±±£³ÖÒ»ÏÂ,ÑÓÊ±¹ı´ó»áÉÁ¶¯£¬ÑÓÊ±¹ıĞ¡»áÓĞÖØÓ°    

     P1=0x00;LE2=1;LE2=0;     //Çå³ıP1¿ÚÊı¾İ£¬ÒÔÃâÔìÖØÓ°
     //ÏÔÊ¾Ê®·ÖÎ»
     P1=0x7f;                 //0xbf=0111 1111,¼´Ñ¡Í¨Ê®·ÖÎ»
     LE1=1;                   //Ëø´æÎ»
     LE1=0;                   //¶Ï¿ªËø´æ,Î»Ñ¡573µÄQ7~Q0ÈÔ±£³Ö 
     P1=dis[n%10];            //0~9µÄ±àÂë
     LE2=1;                   //Ëø´æ¶ÎÂë
     LE2=0;                   //¶Ï¿ªËø´æ,¶ÎÑ¡573µÄQ7~Q0ÈÔ±£³Ö 
     delay(10);              //ÑÓÊ±±£³ÖÒ»ÏÂ,ÑÓÊ±¹ı´ó»áÉÁ¶¯£¬ÑÓÊ±¹ıĞ¡»áÓĞÖØÓ°  

     P1=0x00;LE2=1;LE2=0;     //Çå³ıP1¿ÚÊı¾İ£¬ÒÔÃâÔìÖØÓ°   
          
}
//**************************************************************************************************
//1*5°´¼üÉ¨Ãèº¯Êı
//**************************************************************************************************
keyScan()                             
 {
   P3=P3|0xf8;                //P3¸ß5Î»ÖÃ1£¬ÉèÖÃÎªÊäÈë 
   if((P3&0xf8)!=0xf8)        //ÅĞ¶ÏÊÇ·ñÓĞ°´¼ü°´ÏÂ
    {
     delay(20);               //ÑÓÊ±Ğ¤¶¶
     if((P3&0xf8)!=0xf8)      //ÔÙ´ÎÅĞ¶ÏÊÇ·ñÓĞ°´¼ü°´ÏÂ
       keyValue=(P3&0xf8);    //¶ÁÈ¡É¨Ãè½á¹û
       while((P3&0xf8)!=0xf8);
    }
 }
//**************************************************************************************************
//1*5°´¼üÉ¨Ãè½á¹û´¦Àíº¯Êı
//**************************************************************************************************
keyHandle()                     
 {      
        switch(keyValue)         
          {
            case 0x78:               //Èç¹ûS17°´¼ü°´ÏÂ  
				{
                 zf=1;               //Õı·´±êÖ¾ÖÃ1£¬ÕıÏò
                 break;          
                }
            case 0xb8:               //Èç¹ûS18°´¼ü°´ÏÂ 
				{
                 if(speed>15)speed--;//¼õËÙ 
                   else speed=30;    
                 break;
                }
            case 0xd8:               //Èç¹ûS19°´¼ü°´ÏÂ 
				{
                 stop=~stop;         //Æô¶¯/ÔİÍ£  
                 break;
                }
            case 0xe8:               //Èç¹ûS20°´¼ü°´ÏÂ 
				{                 
                 if(speed<45)speed++;//¼õËÙ 
                   else speed=30;  
                 break;
                }
            case 0xf0:               //Èç¹ûS21°´¼ü°´ÏÂ 
				{
                 zf=0;               //Õı·´±êÖ¾ÖÃ0£¬·´Ïò              
                 break;
                }
            default:
					break;
          }
 }
//**************************************************************************************************
//²½½øµç»ú¿ØÖÆ
//**************************************************************************************************
stepmotor()
{     
     if(stop==0)           //Í£Ö¹±êÖ¾Î»Îª0£¬Ö´ĞĞÒÔÏÂ³ÌĞò£¬Èç¹ûÎª1£¬²»Ö´ĞĞÒÔÏÂ³ÌĞò
       {
           if(zf)          //zf£¬¼´Õı·´±êÖ¾Îª1£¬ÕıÏò×ª¶¯
            { 
             P2=0x01;      //µÈĞ§ÓÚS_D=0,S_C=0,S_B=0,S_A=1
             delay(speed); //ÑÓÊ±£¬ĞŞ¸Ä´Ë²ÎÊı¼´¿ÉĞŞ¸Äµç»ú×ªËÙ
             P2=0x03;      //µÈĞ§ÓÚS_D=0,S_C=0,S_B=1,S_A=1
             delay(speed); 
             P2=0x02;      //iµÈĞ§ÓÚS_D=0,S_C=0,S_B=1,S_A=0
             delay(speed); 
             P2=0x06;      //µÈĞ§ÓÚS_D=0,S_C=1,S_B=1,S_A=0
             delay(speed); 
             P2=0x04;      //µÈĞ§ÓÚS_D=0,S_C=1,S_B=0,S_A=0
             delay(speed); 
             P2=0x0c;      //µÈĞ§ÓÚS_D=1,S_C=1,S_B=0,S_A=0
             delay(speed); 
             P2=0x08;      //µÈĞ§ÓÚS_D=1,S_C=0,S_B=0,S_A=0
             delay(speed); 
             P2=0x09;      //µÈĞ§ÓÚS_D=1,S_C=0,S_B=0,S_A=1
             delay(speed); 
            }
           else            //zf£¬¼´Õı·´±êÖ¾Îª0£¬·´Ïò×ª¶¯¬    
            { 
             P2=0x09;      //µÈĞ§ÓÚS_D=1,S_C=0,S_B=0,S_A=1
             delay(speed); //ÑÓÊ±£¬ĞŞ¸Ä´Ë²ÎÊı¼´¿ÉĞŞ¸Äµç»ú×ªËÙ
             P2=0x08;      //µÈĞ§ÓÚS_D=1,S_C=0,S_B=0,S_A=0
             delay(speed); 
             P2=0x0c;      //µÈĞ§ÓÚS_D=1,S_C=1,S_B=0,S_A=0
             delay(speed);  
             P2=0x04;      //µÈĞ§ÓÚS_D=0,S_C=1,S_B=0,S_A=0
             delay(speed);
             P2=0x06;      //µÈĞ§ÓÚS_D=0,S_C=1,S_B=1,S_A=0
             delay(speed);        
             P2=0x02;      //iµÈĞ§ÓÚS_D=0,S_C=0,S_B=1,S_A=0
             delay(speed);
             P2=0x03;      //µÈĞ§ÓÚS_D=0,S_C=0,S_B=1,S_A=1
             delay(speed);       
             P2=0x01;      //µÈĞ§ÓÚS_D=0,S_C=0,S_B=0,S_A=1
             delay(speed); 
            }           
       }         
}
//**************************************************************************************************
//Ö÷º¯Êı
//**************************************************************************************************
main()
{
  speed=30;                      //³õÊ¼»¯×ªËÙ
   while(1)                      //ËÀÑ­»·£¬µÈ´ı¶¨Ê±Æ÷ÖĞ¶Ï
     {   keyValue=0;             //³õÊ¼»¯¼üÖµÎª0
         keyScan();              //°´¼üÉ¨Ãè
         keyHandle();            //´¦ÀíÉ¨Ãè½á¹û
         stepmotor();            //µç»ú×ª¶¯
         smg_show(speed);        //ÊıÂë¹Ü×îµÍÁ½Î»ÏÔÊ¾×ªËÙ,³õÊ¼»¯Îª30£¬ÖµÔ½´ó£¬×ªËÙÔ½Ğ¡
     } 
}