/***************************************************************************************************    
工程名称：	hw
功能描述：	将卡片放置红外对管中间，8位发光二极管被点亮，拿掉卡片，发光二极管熄灭。
硬件连接：  用8位杜邦线将J8与J13连接，1位杜邦线将J11_0与J5_OUT连接，J5的第7位与J5的第8位用跳帽短接
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件

#define uchar unsigned char
#define uint  unsigned int

sbit duiguan=P2^0;       //定义红外对管检测IO
//**************************************************************************************************
//主函数
//**************************************************************************************************
main()
{
  while(1)          //循环 
  {
    duiguan=1;      //初始化i/0口
    if(duiguan==1)  //判断对管间是否被遮挡
    {
      P1=0x00;     //点亮8位发光二极管
    }
    else
    {
       P1=0xff;    //熄灭8位发光二极管
    }
  }
}