//公司：合肥炜煌电子有限公司
//网址：www.hfwhdz.com
/*===================================================================================================  
工程名称：  Ex4 SD_PIC_SHOW
功能描述：	触摸控制SD卡显示多张图片
硬件连接：  查看和修改接口定义在NBCTFT.C和SD.C中,请仔细检查接口连线。
      ----------------------------------------
     |     --------TFT控制接线----------      |
     |	        D10~D17   接   P0             |
     |          RS        接   P2^5;	      |
     |			RW   	  接   P2^4;          |
     |			RD        接   P2^3;          |
     |		    CS        接   P2^2;	      |
     |			RES       接   P2^1;	      |
     |	                                      |
     |			LE        接   P2^0;          |
     |	                                      |
     |     --------电源供电接线---------      |
     |	        GND       接   电源负极       |
     |	        VIN       接   电源正极(5V)   |
     |----------------------------------------|
     | 如果在NBC开发板上使用，以上线不需用飞  |
     | 线连接，直接插接在开发板上的12864接口  |
     | 后只需连接以下接线                     |
     |----------------------------------------|
     |     --------SD卡控制接线----------     |
     |          SDCS      接   P1^3;	      |
     |			SDDI   	  接   P1^2;          |
     |			SCK       接   P1^1;          |
     |		    SDDO      接   P1^0;	      |
     |                                        |
     |     --------触摸控制接线----------     |
     |          PEN       接   P3^7;	      |
     |	                                      |
	  ----------------------------------------
维护记录：  2012-3-14
====================================================================================================*/

//******************包含头文件***************************
#include <reg52.h>
#include <NBCTFT.H>
#include <SD.H>


//******************全局变量***************************

#define White          0xFFFF   //LCD color
#define Black          0x0000
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0

unsigned int Device_code;      //TFT控制IC型号


//================================================================================================
//	函数名称：	主函数
//	实现功能：	触摸控制SD卡显示多张图片
//	参数：		无
//	返回值：	无
//================================================================================================
	
main()
{
	unsigned int x,y; //定义液晶屏坐标
	unsigned long j;  //执行循环需要的临时变量
	unsigned int i;
	unsigned long AddTemp=288256;//SD卡地址第一个数据物理地址初始值，可以用winhex查看,
                                 //这里是第563扇区，每个扇区512字节，563x512=288256，根据实际SD卡内容更改
	Device_code=0x9320;    
      
    TFT_Initial();               //初始化LCD	 
    CLR_Screen(Blue);            //用背景色清屏
	SdInit();                    //SD卡初始化
   
    while(1)
 	{

 	 for(j=0;j<300;j++)   //300表示一幅图片含有300x512(320x240x2)字节的信息
     {
      SdReadBlock(DATA,AddTemp+(j*512),512);//每次读出512字节放到缓冲区
      for(i=0;i<256;i++)                    //然后写到液晶屏，可以显示256个像素，每个像素16位即2个字节
	   {   
   	    LCD_SetPos(x,x,y,y);
   	    Write_Data(DATA[2*i+1],DATA[2*i]);	 
	    x++;
	    if(x==240)                         //检测是否写到屏的边缘 240x320
	     {
	      y++;
	      x=0;
	      if(y==320)
	      y=0;
	     }
       }
     } 
    // AddTemp = AddTemp+((j+20)*512);  //写完一幅图片后把SD地址加300x512到下一个图片地址
	AddTemp = AddTemp+(j*512);          //32M的SD卡增加为300，其他SD卡实际增加值为320
    while(PEN);                         //等待按键按下继续执行循环显示下一幅图片，如果没有按下则等待
 } 
}
