
/***************************************************************************************************    
工程名称：	bz_jp
功能描述：	控制蜂鸣器实现调节音调的节拍
硬件连接：  用1位杜邦线将J10_0与J18_bz连接
维护记录：  2011-8-22
***************************************************************************************************/
#include<reg51.h>               //包含头文件
sbit BZ=P0^0;                   //定义蜂鸣器控制管脚        
#define uchar unsigned char     
#define uint unsigned int
 
uint code SOUNDTONE[]=         //定义7种不同的频率实现7种音调
                      {262,294,329,350,392,440,495}; 
uint code SOUNDLONG[]=         //定义7种音调对应的节拍
                      {1000,2000,3000,4000,3000,2000,1000}; 

//**************************************************************************************************
//延时函数
//**************************************************************************************************
delay(uint time)              //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;                  //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)         //for循环,循环50*time次
     for(j=0;j<50;j++);       //for循环,循环50次
 }
//**************************************************************************************************
//播放音调
//**************************************************************************************************
void Play_jp()                          
{
  uint Tone,Long;                 //定义音调变量
  uint i,j,k;                     //定义
     for(i=0;i<7;i++)      		  //7种音调循环
      {
          Tone=SOUNDTONE[i];      //读取音调
          Long=SOUNDLONG[i];      //读取节拍
          for(j=0;j<Long;j++)     //输出不同节拍
           {
            BZ=0;                 //关闭蜂鸣器
            for(k=0;k<Tone;k++);  //Tone的不同来区分7种音调
            BZ=1;                 //打开蜂鸣器
            for(k=0;k<Tone;k++);  //Tone的不同来区分7种音调
        }
      }
}
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()
{
 while(1)
  {
   Play_jp();                     //播放7种音调
   BZ=0;                          //关闭蜂鸣器
   delay(10000);                  //关闭蜂鸣器时间
  }
}