
/***************************************************************************************************    
工程名称：	5keyAndLed
功能描述：	当按下S17~S21中的任一个按键，有对应的LED被点亮
硬件连接：  用8位杜邦线将J8与J13连接，
            用5位杜邦线将J9_7与J7_s17、J9_6与J7_s18、J9_5与J7_s19、J9_4与J7_s20、J9_3与J7_s21
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件

sbit s17=P3^7;           //定义S17按键控制IO
sbit s18=P3^6;           //定义S18按键控制IO
sbit s19=P3^5;           //定义S19按键控制IO
sbit s20=P3^4;           //定义S20按键控制IO
sbit s21=P3^3;           //定义S21按键控制IO

#define uchar unsigned char
#define uint  unsigned int

uchar keyValue;          //定义扫描结果参数
//**************************************************************************************************
//延时函数
//**************************************************************************************************
delay(uint time)              //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;                  //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)         //for循环,循环50*time次
     for(j=0;j<50;j++);       //for循环,循环50次
 }
//**************************************************************************************************
//1*5按键扫描函数
//**************************************************************************************************
keyScan()                             
 {
   P3=P3|0xf8;                //P3高5位置1，设置为输入 
   if((P3&0xf8)!=0xf8)        //判断是否有按键按下
    {
     delay(20);               //延时肖抖
     if((P3&0xf8)!=0xf8)      //再次判断是否有按键按下
       keyValue=(P3&0xf8);    //读取扫描结果
    }
 }
//**************************************************************************************************
//1*5按键扫描结果处理函数
//**************************************************************************************************
keyHandle()                     
 {      
        switch(keyValue)         
          {
            case 0xb8:           //如果S17按键按下  
				{
                 uchar  i,j;            //定义变量i,j;
            
                      
         j=0x01;       
   for(i=0;i<8;i++)     //进入for循环,循环8次
     {
	  
      P1=~j;            //依次循环点亮8位LED的1位
      delay(5000);      //延时，修改延时即可修改时间间隔 
      j<<=1;
	                   //j左移1位，j<<=1等效于j=j<<1
     }        
         break;     
                     
                }
            case 0x78:           //如果S18按键按下 
				{
				uchar i,j;
				j=0x7f;
				for(i=0;i<8;i++)
				{
                 P1=j; 
				 delay(5000);
				 j>>=1;
				 P1=P1|0x80;
				 }      //点亮一个发光二极管 
				  P1=0x7f;	   
                 break;
                }
            case 0xd8:           //如果S19按键按下 
				{
                 P1=~0x04;       //点亮一个发光二极管  
                 break;
                }
            case 0xe8:           //如果S20按键按下 
				{
                 P1=~0x08;       //点亮一个发光二极管  
                 break;
                }
            case 0xf0:           //如果S21按键按下 
				{
                 P1=~0x10;       //点亮一个发光二极管  
                 break;
                }
            default:
					break;
          }
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()                   //主函数
{
    
     while(1)                 //进入while死循环
      {
        keyScan();            //按键扫描
        keyHandle();          //处理扫描结果
      }         
}