
/***************************************************************************************************    
工程名称：	RS485
功能描述：	实现485双向通信,若甲板的按键按下,则通过485发送1字节数据，若乙板接收到数据正确,LED将闪烁1下。
硬件连接：  用3位杜邦线分别将J9_0与J17_RO、J9_1与J17_DI以及J9_2与J17_RE连接,
            用1位杜邦线将J11_0与J7_S17连接,用1位杜邦线将J10_0与J13_8连接,
            将甲板和乙板RS485接口的A、B对应（即A对A，B对B）连接。
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件

#define uchar unsigned char
#define uint  unsigned int
 
uchar ch;               //用于存放串口接收到的数据
bit read_flag= 0 ;      //取数标志位 


sbit    LED    =P0^0;   //定义LED
sbit    KEY    =P2^0;   //定义按键

sbit    RO     =P3^0;   //定义RO
sbit    DI     =P3^1;   //定义DI
sbit    RE     =P3^2;   //定义RE,用于发送接收模式选择
//**************************************************************************************************
//延时函数
//**************************************************************************************************
delay(uint time)         //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;             //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)    //for循环,循环50*time次
     for(j=0;j<50;j++); //for循环,循环50次
 }
//**************************************************************************************************
//初始化串口
//**************************************************************************************************
void init_com( void ) 
{ 
  SCON = 0x50;   // 设定通信方式为方式1，允许接收，相当于REN = 1; SM1 = 1;   
  PCON = 0x00;   //SMOD=0，该语句可去掉
  IE |= 0x90 ;   //打开串口中断， 相当于 EA = 1;ES = 1;  

  //以下4句设置T1
  TMOD = 0x20;   // 定时器1工作于8位自动重载模式, 用于产生波特率
  TH1=0xE6;      //定时器0赋初值，TH1=(256 - (12000000 / (32 * 12 * 1200)))=230;
  TL1=0xE6;      //TL1=(256 - (12000000 / (32 * 12 * 1200)))=230;
  TR1 = 1;       //启动T1
} 
//**************************************************************************************************
//串口中断函数
//**************************************************************************************************
void serial () interrupt 4 using 3 

{ 
    if (RI) 
       {  
        RI = 0 ;       //此步必不可少,因为硬件不能将其置0   
        ch=SBUF;       //从SBUF中取出数据       
        read_flag= 1 ; //就置位取数标志 
        }

} 
//**************************************************************************************************
//串口发送函数
//**************************************************************************************************
void send_char( unsigned char ch1) 

         { 
            SBUF=ch1;       //将待发数据放到SBUF 
            while (TI== 0); //等待TI＝1（表示帧发送结束）发送
            TI= 0 ;         //此步必不可少,因为硬件不能将其置0  

          } 
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main(void)
{
 init_com( ) ;        //初始化串口
 while(1)
 {
  if(KEY ==0 )        //判断是否有按键按下
   { 
    delay(100);       //延时消抖
    while(KEY ==0);   //等待按键释放
    RE = 1;           //设置485为发送模式
    send_char(0xaa);  //发送1字节数据
   }

  RE=0;               //设置485为接收模式
  if (read_flag)      //如果取数标志已置位，表示有接收到数据
    { 
      read_flag= 0 ;  //取数标志清0 
      if(ch==0xaa)    //判断485接收到的数据是否正确
       {LED=0;delay(5000);LED=1;} //如果正确，LED闪烁1下
    } 
 } 

} 