
/***************************************************************************************************    
工程名称：	led_shan
功能描述：	使用单片机的P1口做输出口，使8位发光二极管实现由亮逐渐变暗和由暗逐渐变亮
硬件连接：  用8位排线将J8与J13连接
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件

#define uchar unsigned char
#define uint  unsigned int
//**************************************************************************************************
//延时函数
//**************************************************************************************************

void delay(uint time)         //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;             //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)    //for循环,循环50*time次
     for(j=0;j<50;j++);  //for循环,循环50次
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()               //主函数
{ 
 uint i;                   //定义变亮i
 while(1)                 //进入while死循环
  {
     for(i=0;i<200;i++)   //for循环，实现LED由亮逐渐变暗
      {
       P1=0xff;           //熄灭8位发光二极管
       delay(i);          //延时保持熄灭状态i个时间单位
       P1=0x00;           //点亮8位发光二极管
       delay(200-i);      //延时保持点亮状态200-i个时间单位  
      }

   P1=0xff;                //熄灭8位发光二极管
   delay(5000);            //延时保持熄灭状态5000个时间单位，使现象更明显

     for(i=0;i<200;i++)   //for循环，实现LED由暗逐渐变亮
      {
       P1=0x00;           //点亮8位发光二极管
       delay(i);          //延时保持熄灭状态i个时间单位
       P1=0xff;           //熄灭8位发光二极管
       delay(200-i);      //延时保持点亮状态200-i个时间单位  
      }
  }         
}