
/***************************************************************************************************    
工程名称：	led_liushui
功能描述：	使用单片机的P1口做输出口，用8位发光二极管实现流水灯。
硬件连接：  用8位排线将J8与J13连接
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件
sbit led=P1^5;           //表示用led等效于P1^5, P1^0就是指头文件里定义的P1寄存器的第5BIT

#define uchar unsigned char
#define uint  unsigned int
//**************************************************************************************************
//延时函数
//**************************************************************************************************

delay(uint time)         //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;             //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)    //for循环,循环50*time次
     for(j=0;j<50;j++);  //for循环,循环50次
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()             //主函数
{
 uchar  i,j;            //定义变量i,j;
 while(1)               //进入while死循环
  {                     
   j=0x01;              //0x01即为二进制0000 0001,即最低位为1,其他位为0
   for(i=0;i<8;i++)     //进入for循环,循环8次
     {
      P1=~j;            //依次循环点亮8位LED的1位
      delay(5000);      //延时，修改延时即可修改时间间隔 
      j<<=1;            //j左移1位，j<<=1等效于j=j<<1
     }        
  }         
}