//公司：北方蓝芯科技开发有限公司
//网址：www.hrbnbc.com
/*===================================================================================================  
工程名称：  Ex2_TP
功能描述：  采集触摸点坐标，显示在TFT上
硬件连接：  查看和修改接口定义在NBCTFT.C与TP.C中,请仔细检查接口连线后上电测试。
      ----------------------------------------
     |     --------TFT控制接线----------      |
     |	                                      |
     |	        D10~D17   接   P4             |
     |          RS        接   P35	      |
     |		RW   	  接   P34            |
     |		RD        接   P33            |
     |		CS        接   P32	      |
     |		RES       接   P31            |
     |	                                      |
     |		LE        接   P30            |
     |                                        |
     |     --------电源供电接线---------      |
     |	        GND       接   电源负极       |
     |	        VIN       接   电源正极(5V)   |
     |----------------------------------------|
     | 如果在NBC开发板上使用，以上线不需用飞  |
     | 线连接，直接插接在开发板上的12864接口  |
     | 后只需连接以下接线                     |
     |----------------------------------------|
     |     --------触摸控制接线---------      |
     |          PEN       接   P12	      |
     |		TPDO   	  接   P13            |
     |		BUSY      接   P14            |
     |		TPDI      接   P15	      |
     |		TPCS      接   P16	      |
     |	        CLK       接   P17	      |
      ----------------------------------------
维护记录：  2012-3-14
====================================================================================================*/

//******************包含头文件***************************
#include "io430.h"
#include "nbc430.h"
#include"NBCTFT.h"   //包含TFT驱动头文件
#include "TP.H"

//******************全局变量***************************
unsigned int Device_code;

/* LCD color */
#define White          0xFFFF
#define Black          0x0000
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0


//**************************************************************************************************
//时钟初始化
//**************************************************************************************************
/*3种时钟源:1、DCO：内部RC振荡器 2、XTAL1（LFXTAL1）:片外时精确低频时32768Hz,产生ACLK.
          3、XTAL2：片外时钟2，精确高频时钟8MHz,产生MCLK和SMCLK。
输出时钟: 1、MCLK：系统主时钟 2、SMCLK：子系统时钟 3、ACLK：辅助时钟
系统上电时，默认使用DCO时钟做为MCLK，SMCLK；使用XTAL1做为ACLK。XTAL2没有启振，没有
被使用。系统时钟可以选择使用MCK，SMCLK，ACLK其中的一种。需要系统启动后，用软件设置。*/
void init_clock()
{
    uchar i;
    BCSCTL1 &= ~XT2OFF;  //控制XT2振荡器开启(XT2OFF=0)
    BCSCTL2 |=SELM1+SELS;//选择主要时钟 MCLK:XTAL2, SMCLK:XTAL2,不分频
    //清除振荡器错误中断标志，系统启动时不稳定造成的，必须要复位
    do
    {
        IFG1 &= ~OFIFG; //清除振荡器失效标志
        i = 255;        
        while(i--);     //延时等待至少50us
    }while(IFG1&OFIFG); //判断XT2是否起振
}

//***********************************************************************************
//IO初始化操作
//***********************************************************************************
void IO_init(void)
{
	P4DIR=0xff;		  //设置P4为输出
	P4=0xff;                  //设置P4初始化为高电平
	
	P3DIR=0xff;		  //设置P3为输出
	P3=0xff;                  //设置P3初始化为高电平
              
        P1DIR=0xff;		  //设置P1为输出
	P1=0xff;                  //设置P1初始化为高电平
        
}

//================================================================================================
//	函数名称：	画点函数
//	实现功能：	在触摸点位置画点
//================================================================================================
 
void drawpoint(unsigned int x,unsigned int y,unsigned int color)
{
    LCD_SetPos(x,x+1,y,y+1);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
	Write_Data_U16(color);
} 



//================================================================================================
//	函数名称：	主函数
//	实现功能：	采集触摸点坐标，显示在TFT上
//	参数：		无
//	返回值：	无
//================================================================================================
main()
{
    Device_code=0x9320;
    WDTCTL = WDTPW + WDTHOLD;// Stop watchdog timer to prevent time out reset  
    init_clock();
    IO_init();               //IO初始化 
    
    TFT_Initial();           //tft初始化
    start_7843();

    CLR_Screen(Blue);        //清屏				
	
    LCD_PutString(16,5,"Please write on the board!",Magenta,Blue);
   	while(1)
	{	
           if(Getpix()==1)
	   drawpoint(lx,ly,Red); //写（x，y）点为红色

        }
}



