//公司：北方蓝芯科技开发有限公司
//网址：www.hrbnbc.com
/*===================================================================================================  
工程名称：  Ex4 SD_PIC_SHOW
功能描述：  触摸控制SD卡显示多张图片
硬件连接：  查看和修改接口定义在NBCTFT.C和SD.C中,请仔细检查接口连线。
      ----------------------------------------
     |     --------TFT控制接线----------      |
     |	                                      |
     |	        D10~D17   接   P4             |
     |          RS        接   P35	      |
     |		RW   	  接   P34            |
     |		RD        接   P33            |
     |		CS        接   P32	      |
     |		RES       接   P31            |
     |	                                      |
     |		LE        接   P30            |
     |                                        |
     |     --------电源供电接线---------      |
     |	        GND       接   电源负极       |
     |	        VIN       接   电源正极(5V)   |
     |----------------------------------------|
     | 如果在NBC开发板上使用，以上线不需用飞  |
     | 线连接，直接插接在开发板上的12864接口  |
     | 后只需连接以下接线                     |
     |----------------------------------------|
     |     --------SD卡控制接线----------     |
     |          SDCS      接   P17  	      |
     |		SDDI   	  接   P16            |
     |		SCK       接   P15            |
     |		SDDO      接   P14            |
     |                                        |
     |     --------触摸控制接线----------     |
     |          PEN       接   P12 	      |
     |	                                      |
      ----------------------------------------
维护记录：  2012-3-14
====================================================================================================*/

//******************包含头文件***************************
#include "io430.h"
#include "nbc430.h"
#include"NBCTFT.h"   //包含TFT驱动头文件
#include "SD.H"

//******************全局变量***************************

#define White          0xFFFF   //LCD color
#define Black          0x0000
#define Blue           0x001F
#define Blue2          0x051F
#define Red            0xF800
#define Magenta        0xF81F
#define Green          0x07E0
#define Cyan           0x7FFF
#define Yellow         0xFFE0

unsigned int Device_code;      //TFT控制IC型号


//**************************************************************************************************
//时钟初始化
//**************************************************************************************************
/*3种时钟源:1、DCO：内部RC振荡器 2、XTAL1（LFXTAL1）:片外时精确低频时32768Hz,产生ACLK.
          3、XTAL2：片外时钟2，精确高频时钟8MHz,产生MCLK和SMCLK。
输出时钟: 1、MCLK：系统主时钟 2、SMCLK：子系统时钟 3、ACLK：辅助时钟
系统上电时，默认使用DCO时钟做为MCLK，SMCLK；使用XTAL1做为ACLK。XTAL2没有启振，没有
被使用。系统时钟可以选择使用MCK，SMCLK，ACLK其中的一种。需要系统启动后，用软件设置。*/
void init_clock()
{
    uchar i;
    BCSCTL1 &= ~XT2OFF;  //控制XT2振荡器开启(XT2OFF=0)
    BCSCTL2 |=SELM1+SELS;//选择主要时钟 MCLK:XTAL2, SMCLK:XTAL2,不分频
    //清除振荡器错误中断标志，系统启动时不稳定造成的，必须要复位
    do
    {
        IFG1 &= ~OFIFG; //清除振荡器失效标志
        i = 255;        
        while(i--);     //延时等待至少50us
    }while(IFG1&OFIFG); //判断XT2是否起振
}

//***********************************************************************************
//IO初始化操作
//***********************************************************************************
void IO_init(void)
{
	P4DIR=0xff;		  //设置P4为输出
	P4=0xff;                  //设置P4初始化为高电平
	
	P3DIR=0xff;		  //设置P3为输出
	P3=0xff;                  //设置P3初始化为高电平
        
        P2DIR=0xff;		  //设置P2为输出
	P2=0xff;                  //设置P2初始化为高电平
        
        P2DIR4=0;                 //设置数据位为输入
        
        P1DIR=0xff;		  //设置P1为输出
	P1=0xff;                  //设置P1初始化为高电平
        P1DIR2=0;                //设置笔中断位为输入
        P1DIR4=0;                //设置数据位为输入
       
}

//================================================================================================
//	函数名称：	主函数
//	实现功能：	触摸控制SD卡显示多张图片
//	参数：		无
//	返回值：	无
//================================================================================================
	
main()
{
	unsigned int x=0,y=0; //定义液晶屏坐标
	unsigned long j;      //执行循环需要的临时变量
	unsigned int i;
	unsigned long AddTemp=288256;//SD卡地址第一个数据物理地址初始值，可以用winhex查看,
                                     //这里是第563扇区，每个扇区512字节，563x512=288256，根据实际SD卡内容更改
	Device_code=0x9320;    
        WDTCTL = WDTPW + WDTHOLD;    // Stop watchdog timer to prevent time out reset  
        init_clock();
        IO_init();                   //IO初始化 
      
        TFT_Initial();               //初始化LCD	 
        CLR_Screen(Red);             //用背景色清屏
	SdInit();                    //SD卡初始化,初始化必须成功才能读写
   
    while(1)
 	{

 	 for(j=0;j<300;j++)   //300表示一幅图片含有300x512(320x240x2)字节的信息
     {
      SdReadBlock(DATA,AddTemp+(j*512),512);//每次读出512字节放到缓冲区
      for(i=0;i<256;i++)                    //然后写到液晶屏，可以显示256个像素，每个像素16位即2个字节
	   {   
   	    LCD_SetPos(x,x,y,y);
   	    Write_Data(DATA[2*i+1],DATA[2*i]);	 
	    x++;
	    if(x==240)                         //检测是否写到屏的边缘 240x320
	     {
	      y++;
	      x=0;
	      if(y==320)
	      y=0;
	     }
       }
     } 
    // AddTemp = AddTemp+((j+20)*512);  //写完一幅图片后把SD地址加320x512到下一个图片地址
    AddTemp = AddTemp+(j*512);          //32M的SD卡增加为300，其他SD卡实际增加值为320
        
    
    while((P1IN&0x04)==0x04);           //等待按键按下继续执行循环显示下一幅图片，如果没有按下则等待
 } 
}
