/***************************************************************************************************    
¹¤³ÌÃû³Æ£º	PS2_1602
¹¦ÄÜÃèÊö£º	É¨ÃèµÃµ½PS/2¼üÅÌÉÏµÄ×ÖÄ¸ºÍÊý×Ö£¬Í¨¹ý1602Òº¾§ÏÔÊ¾¡£
Ó²¼þÁ¬½Ó£º  ÓÃ2Î»¶Å°îÏß·Ö±ð½«J9_2ÓëJ17_CLK¡¢J9_3ÓëJ17_DAT£¬½«1602Òº¾§½Ó¿Ú¶ÔÓ¦²å½Óµ½P3½Ó¿Ú
Î¬»¤¼ÇÂ¼£º  2011-8-22
***************************************************************************************************/
#include<reg51.h>        //°üº¬Í·ÎÄ¼þ

//ÉùÃ÷Íâ²¿º¯Êý
extern InitLCD(); 
extern xian1();
extern xian2();
extern key_show();
//**************************************************************************************************
//Ö÷º¯Êý
//**************************************************************************************************
void main(void)
{
 InitLCD();        //³õÊ¼»¯Òº¾§
 IT1 = 0;          //ÉèÍâ²¿ÖÐ¶Ï1ÎªµÍµçÆ½´¥·¢
 EA = 1;           //Íâ²¿ÖÐ¶Ï¿ª
 EX0 = 1;          //¿ªÖÐ¶Ï
 xian1();          //ÏÔÊ¾µÚÒ»ÐÐ
 xian2();          //ÏÔÊ¾µÚ¶þÐÐ          
 while(1)
 {
  key_show();      //É¨ÃèµÃµ½PS/2¼üÅÌÉÏµÄ×ÖÄ¸ºÍÊý×Ö£¬Í¨¹ý1602Òº¾§ÏÔÊ¾¡
 }
}