//公司：北方蓝芯科技开发有限公司
//网址：www.hrbnbc.com
//更多教程可登陆技术论坛www.hrbnbc.com/bbs对应版块下载，
//所有教程一律免费下载
/***************************************************************************************************    
工程名称：	PS/2
功能描述：  实现键盘上的字母和数字扫描
硬件连接：  用2位杜邦线分别将J9_2与J17_CLK、J9_3与J17_DAT
维护记录：  2011-8-22
***************************************************************************************************/
#include<reg51.h>        //包含头文件
#define uchar unsigned char
#define uint  unsigned int

sbit Key_DAT  = P3^3 ;   //定义Keyboard引脚
sbit Key_CLK  = P3^2;    //使用中断


bit flag;                //标志位,有按键按下时，置1
bit Shift;               //定义上档键标志
bit Key_UP;              //定义通码断码标志
uchar key_value;         //定义键盘值
uchar n_bit;
uchar LCD_num;

uchar code key_code[59][2] = {
0x1C, 'a',0x32, 'b',0x21, 'c',0x23, 'd',0x24, 'e',0x2B, 'f',0x34, 'g',0x33, 'h',0x43, 'i',0x3B, 'j',
0x42, 'k',0x4B, 'l',0x3A, 'm',0x31, 'n',0x44, 'o',0x4D, 'p',0x15, 'q',0x2D, 'r',0x1B, 's',0x2C, 't',
0x3C, 'u',0x2A, 'v',0x1D, 'w',0x22, 'x',0x35, 'y',0x1A, 'z',0x45, '0',0x16, '1',0x1E, '2',0x26, '3',
0x25, '4',0x2E, '5',0x36, '6',0x3D, '7',0x3E, '8',0x46, '9',0x0E, '`',0x4E, '-',0x55, '=',0x5D, '\\',
0x29, ' ',0x54, '[',0x5B, ']',0x4C, ';',0x52, '\'',0x41, ',',0x49, '.',0x4A, '/',0x71, '.',0x70, '0',
0x69, '1',0x72, '2',0x7A, '3',0x6B, '4',0x73, '5',0x74, '6',0x6C, '7',0x75, '8',0x7D, '9',};

extern wcode(uchar);
extern wdata(uchar);
//**************************************************************************************************
//外部中断，读取键值(请阅读指导书中的时序图)
//**************************************************************************************************
void key_in(void) interrupt 0        //CLK为低，进入中断
{
 if ((n_bit > 0) && (n_bit < 9))     //读取编码，读键盘发来的bit1-bit8，去掉起始位bit0
   { 
	key_value = key_value >> 1;      //左移1位，依次从低位到高位
	if (Key_DAT)                     //如果数据位为1
    	key_value = key_value | 0x80;//将key_value最高位置1
	}
	n_bit++;                         //位数加1
	while (!Key_CLK);                //等待CLK拉高

	if (n_bit > 10)                  //11位（1起始位+8数据位+1校验位+1停止位）数据读取完毕
	   { 
 		n_bit = 0;                   //当中断11次后表示一帧数据收完，清变量准备下一次接收
 		flag = 1;                    //标志位值1，
		EA = 0;                      //关中断等显示完后再开中断 
		}

}
//**************************************************************************************************
//解码并显示(组合键的扫描码发送按照按键发生的次序,例如按下左SHIFT+A键：1、按下左SHIFT键,2、按下A键,
//           3、释放A键,4、释放左SHIFT键,那么MCU接收到的一串数据为0x12 0x1C 0xF0 0x1C 0xF0 0x12)
//**************************************************************************************************
void Code_show()  
{
uchar i,show_data; 
if(LCD_num==0)wcode(0x01);	        //进入中断，先清除液晶初始化内容
if (!Key_UP)                        //当键盘按下时
	{
	switch (key_value)
			{
			case 0xF0 :             // 当收到0xF0，表示按键释放
				Key_UP = 1;         //Key_UP置1表示断码开始
				break;

			case 0x12 :             // 左SHIFT按下
				Shift = 1;          //shift标志置1
				break;
			case 0x59 :             // 右SHIFT按下
				Shift = 1;          //shift标志置1
				break;

			default: 

				for(i=0;(key_code[i][0]!=key_value)&&(i<59);i++);//查表,key_code[i][0]=key_value时,结束for循环

   				show_data= key_code[i][1];   //将解码数据赋给show_data,待写入1602显示

                  if(LCD_num/16==0) wcode(0x80 | LCD_num%16);//写1602地址
                   else wcode(0xc0 | LCD_num%16);

                  if(Shift) wdata(show_data-0x20);//1602液晶中，大写字母的地址是小写字母的地址减去0x20
                   else wdata(show_data);

						LCD_num++;
   						if(LCD_num==33)
     					  {
                          wcode(0x01);	  //清屏
	  					  LCD_num=0;      //重头写数据
	 				      }
		 			break;
 			}
	}
else
	{ 
	Key_UP = 0;
	switch (key_value) //当键松开时不处理判码，如G 34H F0H 34H 那么第二个34H不会被处理
			{
			case 0x12 : // 左 SHIFT
				Shift = 0;
				break;

			case 0x59 : // 右 SHIFT
				Shift = 0;
				break;
			}
	}
flag = 0; //处理完后，清标志位

} 

//**************************************************************************************************
//按键处理
//**************************************************************************************************
void key_show(void)
{

 if (flag)
   Code_show();//解码并显示按键值
 else
   EA = 1;     //开中断
}
