/***************************************************************************************************    
工程名称：	DS1302_serial
功能描述：	读取DS1302中的秒数据，通过串口发送到PC上，PC机上使用串口调试助手，波特率1200bps。
硬件连接：  用3位杜邦线分别将J8_0与J7_CLK、J8_1与J7_I/O、J8_2与J7_RST连接,使用USB转串口，无需接串线
维护记录：  2011-8-22
***************************************************************************************************/
//声明外部函数
extern init_com();                         
extern void send_char(unsigned char a);    //向串口发送字符串 
extern InitDS1302();                       //初始化时钟
extern GetDS1302();                        //提取时钟参数

#define uchar unsigned char
#define uint  unsigned int
//声明外部变量
extern struct S_TIME
	{
		uchar SEC;			//00~59
		uchar MIN;			//00~59
		uchar HR;			//00-23
		uchar DATE;			//00-31
		uchar MONTH;		//01-12
		uchar DAY;			//01-07
		uchar YEAR;			//00-99
	}TIME;

//**************************************************************************************************
//延时
//**************************************************************************************************
void delay(uint time)              //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;                  //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)         //for循环,循环50*time次
     for(j=0;j<100;j++);       //for循环,循环50次
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main(void)
{
   init_com();              //初始化串口
   InitDS1302();            //初始化时钟
    while(1)
     {
      GetDS1302();          //提取时钟参数
      send_char(TIME.SEC);  //将读到的秒参数从串口发出 
      delay(1000);          //延时
     } 
}
