#include "reg51.h"       //包含头文件

#define uchar unsigned char
#define uint  unsigned int
 
uchar ch;               //用于存放串口接收到的数据
bit read_flag= 0 ;      //取数标志位 

//**************************************************************************************************
//初始化串口
//**************************************************************************************************
void init_com( void ) 

{ 
  SCON = 0x50;   // 设定通信方式为方式1，允许接收，相当于REN = 1; SM1 = 1;   
  PCON = 0x00;   //SMOD=0，该语句可去掉
  IE |= 0x90 ;   //打开串口中断， 相当于 EA = 1;ES = 1;  

  //以下4句设置T1
  TMOD = 0x20;   // 定时器1工作于8位自动重载模式, 用于产生波特率
  TH1=0xE6;      //定时器0赋初值，TH1=(256 - (12000000 / (32 * 12 * 1200)))=230;
  TL1=0xE6;      //TL1=(256 - (12000000 / (32 * 12 * 1200)))=230;
  TR1 = 1;       //启动T1
 
} 
//**************************************************************************************************
//串口中断函数
//**************************************************************************************************
void serial () interrupt 4 using 3 

{ 
    if (RI) 

       {  
        RI = 0 ;       //此步必不可少,因为硬件不能将其置0   
        ch=SBUF;       //从SBUF中取出数据       
        read_flag= 1 ; //就置位取数标志 
        }

} 
//**************************************************************************************************
//串口发送函数
//**************************************************************************************************
void send_char( unsigned char ch1) 

         { 
            SBUF=ch1;       //将待发数据放到SBUF 
            while (TI== 0); //等待TI＝1（表示帧发送结束）发送
            TI= 0 ;         //此步必不可少,因为硬件不能将其置0  

          } 

 