/***************************************************************************************************    
工程名称：	HC595_led
功能描述：	数据通过595串入并出，驱动8位发光二极管实现流水灯。
硬件连接：  用8位杜邦线将J13与J16连接，用3位杜邦线分别将J8_5与J21_SH、J8_6与J21_ST、J8_7与J21_DS连接
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"       //包含头文件
sbit SH_CP=P1^5;         //表示用SH_CP等效于P1^5, P1^0就是指头文件里定义的P1寄存器的第5BIT
sbit ST_CP=P1^6;         
sbit DS=P1^7;         

#define uchar unsigned char
#define uint  unsigned int
//**************************************************************************************************
//延时函数
//**************************************************************************************************
delay(uint time)         //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;             //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)    //for循环,循环50*time次
     for(j=0;j<50;j++);  //for循环,循环50次
 }
//**************************************************************************************************
//向74595写一字节数据
//**************************************************************************************************
wbyte_595(uchar temp)               
 {
     uchar i;                      //定义循环变量
     ST_CP=0;                      //置为低电平
     for(i=0;i<8;i++)              //循环8次，写入1字节
      {
       SH_CP=0;                    //时钟置为低电平
       if((temp & 0x80)!=0)  DS=1; //如果最高位为1，发送数据1
         else DS=0;                //如果最高位为0，发送数据0
       SH_CP=1;                    //数据在SHcp的上升沿输入到移位寄存器中
       temp<<=1;                   //左移1位，准备写入下1位数据
      }
    ST_CP=1;                       //上升沿时移位寄存器的数据进入数据存储寄存器
    delay(10);                     //延时
 }
//**************************************************************************************************
//主函数
//**************************************************************************************************
void main()             //主函数
{
 uchar  i,j;            //定义变量i,j;
 while(1)               //进入while死循环
  {                     
   j=0x01;              //0x01即为二进制0000 0001,即最低位为1,其他位为0
   for(i=0;i<8;i++)     //进入for循环,循环8次
     {
      wbyte_595(~j);    //依次循环点亮8位LED的1位，取反是由于低电平点亮LED
      delay(5000);      //延时，修改延时即可修改时间间隔 
      j<<=1;            //j左移1位，等效于j=j<<1
     }        
  }         
}