/***************************************************************************************************    
工程名称：	1602
功能描述：  实现1602液晶显示，液晶第一行显示"  Welocome  To  "，第二行显示" www.hrbnbc.com "。
硬件连接：  将1602液晶接口对应插接到P4接口，注意1-16脚不要插反（有些厂家的液晶顺序是反的）。
维护记录：  2011-8-22
***************************************************************************************************/
#include "reg51.h"          //包含头文件
#define uchar unsigned char
#define uint  unsigned int

extern delay(uint time); 
extern uchar  ge,shifen;

sbit rs=P2^5;    //命令/数据选择
sbit rw=P2^4;    //读写口
sbit  e=P2^3;    //锁存控制

uchar data  dis1[16]={"  Welocome  To  "};     //显示两行
uchar data  dis2[16]={" www.hrbnbc.com "};
//**************************************************************************************************
//向LCD写一命令
//**************************************************************************************************
wcode(uchar t)
{
  rs=0;           // 写的是命令
  rw=0;           // 写状态
  e=1;            //使能
  P0=t;           //写入命令 
  delay(20);      //等待写入,如果时间太短，会导致液晶无法显示
  e=0;            //数据的锁定
}
//**************************************************************************************************
//向LCD写一数据
//**************************************************************************************************
wdata(uchar t)
{
  rs=1;          // 写的是数据
  rw=0;          // 写状态
  e=1;           //使能
  P0=t;          //写入数据
  delay(20);     //等待写入,如果时间太短，会导致液晶无法显示
  e=0;           //数据的锁定
}
//************************************************************************************
//功能：LCD显示
//************************************************************************************
show()
{
  wcode(0x80); 
  wdata('T');wdata('h');wdata('e');wdata(' ');   //显示The 
  wdata('v');wdata('o');wdata('l');wdata('t');   //显示volt
  wdata(' ');wdata('n');wdata('o');wdata('w');   //显示now
  wdata(' ');wdata('i');wdata('s');wdata(':');   //显示is:

  wcode(0xcb);                       //设置第一行显示地址
  wdata(ge+0x30);                    //显示0通道电压值个位 
  wdata('.');                        //显示小数点
  wdata(shifen+0x30);                //显示0通道电压值十分位        
  wdata('V');
}
//**************************************************************************************************
//LCD 初始化
//**************************************************************************************************
InitLCD()
   {  		 
   wcode(0x01);	  //清屏
   wcode(0x06);   //输入方式控制,增量光标不移位
   wcode(0x0e);   //显示开关控制
   wcode(0x38);   //功能设定:设置16x2显示，5x7显示,8位数据接口     	
   }  
